# Data Manipulation

In [4]:
import pandas as pd

dataFrame = pd.read_csv("data.csv")
dataFrame.head(5)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [5]:
dataFrame.describe()  # Only Take Numerical Columns

           Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000

In [ ]:
# Handling Missing Values
dataFrame.isnull()  # True if Missing Otherwise False

In [7]:
data = [
    {"Name": "Prabhjeet", "Age": 20, "Gender": "Female"},
    {"Name": "Raman"},
    {"Name": "John", "Age": 25, "Gender": "Male"},
]
df = pd.DataFrame(data)
df.isnull()  # Mark All Places False if Exists & if missing then True

    Name    Age  Gender
0  False  False   False
1  False   True    True
2  False  False   False

In [8]:
# Tell Missing Values With Respect to Column
df.isnull().any()

Name      False
Age        True
Gender     True
dtype: bool

In [17]:
# Summing up How Many Missing Values in Column
df.isnull().sum()

Name          0
Age           1
Gender        1
Age_Fillna    0
dtype: int64

In [10]:
# Filling Missing Values With 0
df_filled = df.fillna(0, inplace=False)  # Temporary

In [15]:
## Filling Missing Values of a Column with the mean of the Column
df["Age_Fillna"] = df["Age"].fillna(df["Age"].mean())
df

        Name   Age  Gender  Age_Fillna
0  Prabhjeet  20.0  Female        20.0
1      Raman   NaN     NaN        22.5
2       John  25.0    Male        25.0

In [19]:
# Printing DataTypes
df.dtypes

Name           object
Age           float64
Gender         object
Age_Fillna    float64
dtype: object

## Column Modification

In [21]:
df = df.rename(columns={"Age_Fillna": "Mean Age"})  # Renaming Column
df

        Name   Age  Gender  Mean Age
0  Prabhjeet  20.0  Female      20.0
1      Raman   NaN     NaN      22.5
2       John  25.0    Male      25.0

In [24]:
# Change DataType of Column
df["Age_int"] = df["Age"].fillna(df["Age"].mean()).astype(int)
df

        Name   Age  Gender  Mean Age  Age_int
0  Prabhjeet  20.0  Female      20.0       20
1      Raman   NaN     NaN      22.5       22
2       John  25.0    Male      25.0       25

In [31]:
# Applying Function To A Column

df["Age_int_function"] = df["Age_int"].apply(lambda x: x**2)
df
# df.drop("Age_int_function", axis=1, inplace=True)

        Name   Age  Gender  Mean Age  Age_int  Age_int_function
0  Prabhjeet  20.0  Female      20.0       20               400
1      Raman   NaN     NaN      22.5       22               484
2       John  25.0    Male      25.0       25               625

# Data Aggregating & Grouping [V.IMP]

In [12]:
data = [
    {"Name": "Prabhjeet", "Age": 20, "Gender": "Male", "location": "Delhi"},
    {"Name": "John", "Age": 17, "Gender": "Male", "location": "Delhi"},
    {"Name": "Raman", "Age": 23, "Gender": "Female", "location": "New York"},
    {"Name": "Raju", "Age": 45, "Gender": "Male", "location": "Texas"},
]
df = pd.DataFrame(data)
df

        Name  Age  Gender  location
0  Prabhjeet   20    Male     Delhi
1       John   17    Male     Delhi
2      Raman   23  Female  New York
3       Raju   45    Male     Texas

#### Grouping Data

In [13]:
# Group data by gender and then give mean
grouped_mean = df.groupby("Gender")["Age"].mean().astype(int)
print(grouped_mean)

Gender
Female    23
Male      27
Name: Age, dtype: int64

#### Multiple Columns Group Data

In [16]:
# Give Age Sum Based On The Location
grouped_age_sum = df.groupby(["location", "Gender"])["Age"].sum().astype(int)
grouped_age_sum

location  Gender
Delhi     Male      37
New York  Female    23
Texas     Male      45
Name: Age, dtype: int64

### Multiple Aggregate Functions

In [18]:
grouped_agg = df.groupby(["location"])["Age"].agg(["mean", "sum", "count"])
grouped_agg

          mean  sum  count
location
Delhi     18.5   37      2
New York  23.0   23      1
Texas     45.0   45      1

## Merging & Joining DataFrames

In [21]:
# Creaating 2 Data Frames
data1 = {"Key": ["A", "B", "D"], "Val1": [10, 12, 7]}
data2 = {"Key": ["A", "B", "C"], "Val2": [2, 3, 89]}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
df1

  Key  Val1
0   A    10
1   B    12
2   D     7

In [20]:
df2

  Key  Val2
0   A     2
1   B     3
2   C    89

### INNER JOIN

In [30]:
pd.merge(df1, df2, on="Key", how="inner")

# on -> Which Column Name
# how -> Join Name	[inner JOIN] => Only Common Considered

  Key  Val1  Val2
0   A    10     2
1   B    12     3

### OUTER JOIN

In [29]:
pd.merge(df1, df2, on="Key", how="outer")

# on -> Which Column Name
# how -> Join Name	[outer JOIN] => ALL row Considered

  Key  Val1  Val2
0   A  10.0   2.0
1   B  12.0   3.0
2   C   NaN  89.0
3   D   7.0   NaN

### LEFT OUTER JOIN

In [32]:
pd.merge(df1, df2, on="Key", how="left")
# Left More Priority

  Key  Val1  Val2
0   A    10   2.0
1   B    12   3.0
2   D     7   NaN

### Right OUTER JOIN

In [33]:
pd.merge(df1, df2, on="Key", how="right")
# Left More Priority

  Key  Val1  Val2
0   A  10.0     2
1   B  12.0     3
2   C   NaN    89